
print(r'''
*******************************************************************************
          |                   |                  |                     |
 _________|________________.=""_;=.______________|_____________________|_______
|                   |  ,-"_,=""     `"=.|                  |
|___________________|__"=._o`"-._        `"=.______________|___________________
          |                `"=._o`"=._      _`"=._                     |
 _________|_____________________:=._o "=._."_.-="'"=.__________________|_______
|                   |    __.--" , ; `"=._o." ,-"""-._ ".   |
|___________________|_._"  ,. .` ` `` ,  `"-._"-._   ". '__|___________________
          |           |o`"=._` , "` `; .". ,  "-._"-._; ;              |
 _________|___________| ;`-.o`"=._; ." ` '`."\ ` . "-._ /_______________|_______
|                   | |o ;    `"-.o`"=._``  '` " ,__.--o;   |
|___________________|_| ;     (#) `-.o `"=.`_.--"_o.-; ;___|___________________
____/______/______/___|o;._    "      `".o|o_.--"    ;o;____/______/______/____
/______/______/______/_"=._o--._        ; | ;        ; ;/______/______/______/_
____/______/______/______/__"=._o--._   ;o|o;     _._;o;____/______/______/____
/______/______/______/______/____"=._o._; | ;_.--"o.--"_/______/______/______/_
____/______/______/______/______/_____"=.o|o_.--""___/______/______/______/____
/______/______/______/______/______/______/______/______/______/______/_____ /
*******************************************************************************
''')
print("Welcome to Treasure Island.")
print("Your mission is to find the treasure.")

# lower() -- This function can help lower the text
# Three quotes can help write multiple lines of string

# .casefold() - More aggressive version of lower()
print("Crikey Mate!!!! You are at cross roads!!")
choice1 = input("Where do you wanna go from here? Left or Right\n -->").casefold()


if choice1 == "left":
    print("""
                        ,////,
                        /// 6|
                        //  _|
                       _/_,-'
                  _.-/'/   \\   ,/;,
               ,-' /'  \\_   \\ / _/
               `\\ /     _/\\  ` /
                 |     /,  `\\_/
                 |     \'
    pb  /\\_        /`      /\
    /' /_``--.__/\\  `,. /  \
    |_/`  `-._     `\\/  `\\   `.
            `-.__/'     `\\   |
                          `\\  \
                            `\\ \
                              \\_\\__
                               \\___)
    
    """)
    print()
    print("Cricky cricky crickyyyyy mateeeee!!!!!!!! There's wotah!!! Yeah, Not boól of wotah but like a seaaaa!! hu ha ha ha ha")
    choice2 = input("matey!!! You wanna SWIM or WAIT!!!!!!!\n--->").casefold()
    if choice2 == "wait":
        print("I see you are a smart man, Amigo!!")
        print("LESGO MATE, I Donno how the fish this scenery changed? Maybe some sorcery!!!!! Is voldemort here? Nah! I am kidding. HEHEHEHEH (*Laughs in Aussie Accent*)")
        print("Woah Bruh! We have 3 doors. Red, Blue and Yellow.")
        choice3 = input("Choose one\n --->>").casefold()
        if choice3 == "red":
            print("""
                        (  .      )
             )           (              )
                 .  '   .   '  .  '  .
            (    , )       (.   )  (   ',    )
            .' ) ( . )    ,  ( ,     )   ( .
            ). , ( .   (  ) ( , ')  .' (  ,    )
            (_,) . ), ) _) _,')  (, ) '. )  ,. (' )
            ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
            """)
            print("LOLOLOLOLOLOZZZZZ!!!! Type shi, You got lit mate!!!")
            print("Burned by Fire\nGame Over")
        elif choice3 == "blue":
            print("""
                           (    )
                          ((((()))
                          |o\\ /o)|
                          ( (  _')
                           (._.  /\\__
                          ,\\___,/ '  ')
            '.,_,,       (  .- .   .    )
             \\   \\     ( '        )(    )
              \\   \\    \\.  _.__ ____( .  |
               \\  /\\   .(   .'  /\\  '.  )
                \\(  \\.-' ( /    \\/    \\)
                 '  ()) _'.-|/\\/\\/\\/\\/\\|
                     '\\ .( |\\/\\/\\/\\/\\/|
                       '((  \\    /\\    /
                       ((((  '.__\\/__.')
                        ((,) /   ((()   )
                         "..-,  (()("   /
                    pils  _//.   ((() ."
                  _____ //,/" ___ ((( ', ___
                                   ((  )
                                    / /
                                  _/,/'
                                /,/,"

            """)
            print("Bruh!! You got eaten by the beast")
            print(" \"L\" in the chat\nGame Over")
        elif choice3 == "yellow":
            print("""
            You Win, You da GOAT bruh!! Congratulations, 
            No Dumb Choices. You smart Mateeee!!!!
                 ___________
                '._==_==_=_.'
                .-\\:      /-.
               | (|:.     |) |
                '-|:.     |-'
                  \\::.    /
                   '::. .'
                     ) (
                   _.' '._
                 `"""""""`
            
            Woah!! There's a lot of treasure!! 
                        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⢀⣀⡀⠀⠀⠀⠀⠀         ⢀⣠⢀⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⢀⣤⣴⣶⠟⠃⠉⠀⠀⠀⠈⠙⢶⣤⡀⠀⠀⠀       ⢀       ⣤⣴⣶⠟⠃⠉⠀⠀⠀⠈⠙⢶⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀
            ⠀⠀⠀⠀⢀⢤⣺⣿⣿⣿⠇⠀⠀⠀⠀⠀⢀⣠⣤⣬⣿⣿⣷⣄⣂⠀⠀     ⢀   ⢤⣺⣿⣿⣿⠇⠀⠀⠀⠀⠀⢀⣠⣤⣬⣿⣿⣷⣄⣂⠀⠀⠀⠀⠀
            ⠀⠀⢖⢼⡺⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠈⠹⠿⠿⣿⣿⣿⣿⣚⠸⣣⠆⠀⠀⠀ ⢖⢼⡺⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠈⠹⠿⠿⣿⣿⣿⣿⣚⠸⣣⠆⠀⠀
            ⠀⠀⠀⠀⠑⠨⢟⣿⣿⣿⣆⠠⡀⠀⠀⠀⠀⠀⠀⢠⣿⣿⠿⠣⠙⠁⠁⠀⠀       ⠑⠨⢟⣿⣿⣿⣆⠠⡀⠀⠀⠀⠀⠀⠀⢠⣿⣿⠿⠣⠙⠁⠁⠀⠀⠀
            ⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠻⠦⣈⡱⡲⢖⣌⠅⠴⠟⠋⠁⠀⠀⠀⠀⠀             ⠉⠛⠻⠦⣈⡱⡲⢖⣌⠅⠴⠟⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
            Share some treasure with me Mateee!!!!!!
            Pleaseee!!!!
            NOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO!!!! DON'T YOU RUN AWAYYYYYY!!!!
            *Crying soundssss!!*
            """)
        else:
            print("""
                       .=.,
                      ;c =
                    __|  _/
                  .'-'-._/-'-._
                 /..   ____    
                /' _  [<_->] )  
               (  / \\--\\_>/-/'._ )
                \\-;_/\\__;__/ _/ _/
                 '._}|==o==\\{_\\/
                  /  /-._.--\\  \\_
                 // /   /|   \\ \\ 
                / | |   | \\;  |  \\ 
               / /  | :/   \\: \\   \\_
              /  |  /.'|   /: |    \\ 
              |  |  |--| . |--|     \\_
              / _/   \\ | : | /___--._) 
             |_(---'-| >-'-| |       '-'
                   /_/     \\_

""")
            print("Congratulations!!!! You made another dumb choice, \n"
                  "Game Over")

    else:
        print("""
                             ^`.                     o
             ^_              \\  \\                  o  o
             \\ \\             {   \\                 o
             {  \\           /     `~~~--__
             {   \\___----~~'              `~~-_     ______          _____
              \\                         /// a  `~._(_||___)________/___
              / /~~~~-, ,__.    ,      ///  __,,,,)      o  ______/    \
              \\/      \\/    `~~~;   ,---~~-_`~= \\ \\------o-'            \
                               /   /            / /
                              '._.'           _/_/
                                              ';|\
        """)
        print("HUHAHAHAHAHAHAHAHAH Mateyyyyyy!!! Dumb choices leads to dumb consequences, You got attacked by a Trout!!! LOL!!!")
        print("NO REDBULL FOR YOU MATE!!! HAHAHAHAHAHAHAHAHA")
        print("Game Over")
else:
    print("""                                      +---+
                                      |\\   \
  +-----------------------------+     | +---+
   \\                      +-----------+ |   |
    \\                      \\            |   |
     \\                 |/   +-----------+   |
      \\                (c_      |   \\ | |   |
       \\                \\       |    \\| |   |
        \\                       |     | |   |
         \\                      |     + |   |
          \\                     |      \\| DM|
           \\--------------------+       +---+
            \\                    \\        \
             \\                    \\        \
              +-----------------------------+
 
    """)
    print("You Fell in a hole!! HEHEHEHHEHEH!!!!!!!!")
    print("You are dead, Game Over!! HUHAHAHAHAHAHHA")
